Repository: s92854/entitled_routes
Catalog: lib/l10n/intl_*.arb
Languages: de

# settingstitle
source: Settings
de: Einstellungen

source: Language
de: Sprache

source: Map
de: Karte

source: Settings
de: Einstellungen

source: Search...
de: Suchen...

source: Start Point...
de: Startpunkt...

# endpoint
source: Target Point...
de: Ziel...

# curpos
source: Use current position
de: Aktuelle Position verwenden

source: Clear input
de: Eingaben löschen

# m
source: meters
de: Meter

# km
source: kilometers
de: Kilometer

# mi
source: miles
de: Meilen

# linedistance
source: Distance
de: Distanz

# distance
source: Direct distance
de: Luftlinie

# searchactive
source: Activate search mode
de: Suchmodus aktivieren

# searchinactive
source: Deactivate search mode
de: Suchmodus deaktivieren

# uppos
source: Update position
de: Position aktualisieren

# welcometitle
source: Welcome to Entitled Routes!
de: Willkommen bei Entitled Routes!

# about
source: About the App
de: Über die App

# functionstitle
source: Functions
de: Funktionen

# func1
source: - OpenStreetMap Basemap
de: - OpenStreetMap Basiskarte

# func2
source: - Accessing and displaying the current position (Geolocation)
de: - Aktuelle Position abrufen und anzeigen (Geolocation)

# func3
source: - Search for places, adresses, POIs and coordinates (Geocoder)
de: - Suche nach Orten, Adressen, POIs und Koordinaten (Geocoder)

# func4
source: - Generating the shortest route between two points
de: - Kürzeste Route zwischen zwei Punkten generieren

# func5
source: - Calculate direct distance between these two points
de: - Luftlinie zwischen diesen beiden Punkten berechnen

# func6
source: - Saving settings to local storage and accessing after app restart
de: - Einstellungen werden lokal gespeichert und nach App-Neustart abgerufen

# func7
source: - Dark mode for better readability
de: - Dunkles Design für bessere Lesbarkeit

# func8
source: - Multi language support (English, German)
de: - Unterstützung mehrerer Sprachen (Englisch, Deutsch)

# func9
source: - Using metrical or imperial units
de: - Verwendung metrischer oder imperialer Einheiten

# func10
source: - Selecting different map styles
de: - Verschiedene Kartenstile

# func11
source: - Switching between different spheroids
de: - Auswahl verschiedener Spheroide zur Berechnung der Route

# dev
source: Developer
de: Entwickler

# unit
source: Use Metric Units
de: Metrische Einheiten verwenden

source: Spheroid
de: Referenzellipsoid

# sellang
source: Language
de: Sprache

source: Map Style
de: Kartenstil

source: Reset to Default
de: Einstellungen zurücksetzen
